Revit 2026 API

# FamilyInstanceAddCoping Method

---

Adds a coping (cut) to a steel beam.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool AddCoping(
	FamilyInstance cutter
)
```
```vb
Public Function AddCoping (
	cutter As FamilyInstance
) As Boolean
```
```cpp
public:
bool AddCoping(
	FamilyInstance^ cutter
)
```
```fsharp
member AddCoping :
        cutter : FamilyInstance -> bool
```

#### Parameters

cutter FamilyInstance
    A steel beam or column. May not be  or itself.

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when 'cutter' is . |
| ArgumentException | Thrown when 'cutter' refers to this instance. |
| InvalidOperationException | Thrown when regeneration fails. |

This beam will be cut to fit another element, the cutter. The cut will include an offset determined by the parameter STRUCTURAL_COPING_DISTANCE. The parameter affects all copings on this element. This function corresponds to Tools -> Coping in Revit Structure.

#### Reference

FamilyInstance Class

Autodesk.Revit.DB Namespace